course/数理逻辑/homework/1/homework.tex
% Created 2021-09-17 Fri 11:21
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\input{../preamble.tex}
\usepackage[UTF8]{ctex}
\author{陈淇奥}
\date{\today}
\title{Homework}
\hypersetup{
 pdfauthor={陈淇奥},
 pdftitle={Homework},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.2 (Org mode 9.5)}, 
 pdflang={English}}
\begin{document}

\maketitle
\begin{exercise}[1.2.3]
找出3个性质\(P(x)\)使得集合\(\{x\in\R:P(x)\}\)为\(\{1\}\)；找出三个性质性质\(Q(x)\)使得集合\(\{x\in\Z:Q(x)=\emptyset\}\)
\end{exercise}

\begin{proof}
\begin{align*}
&P_1(x):x=1\\
&P_2(x):x^2=1\wedge \neg(x=-1) \\
&P_3(x):\forall v\;vx=v\\
&Q_1(x):\forall v\;x>v\\
&Q_2(x):x=1\wedge x=2\\
&Q_3(x):1<x\wedge x<2
\end{align*}
\end{proof}

\begin{exercise}[1.2.4]
在有可能的情况下找出
\begin{enumerate}
\item 两个无穷集合\(A\)和\(B\)使得\(A\cap B=\{1\}\)且\(A\cup B=\Z\)
\item 两个集合\(C\)和\(D\)使得\(C\cup D=\{t,h,i,c,k\}\)且\(C\cap D=\{t,h,i,n\}\)
\end{enumerate}
\end{exercise}

\begin{proof}
\begin{enumerate}
\item \(A=\{2x:x\in\Z\}\cup\{1\}\), \(B=\{2x+1:x\in\Z\}\)
\item 不存在这样的\(C\)和\(D\)。如果存在这样的\(C\)和\(D\),因为\(n\in C\cap D\)，于是\(n\in C\cup D\),但是\(n\notin C\cup D\)，于是矛盾
\end{enumerate}
\end{proof}

\begin{exercise}[1.3.2]
假定\(a,b,c,n\in\Z\)且\(n>0\)。证明同余关系的下列性质
\begin{enumerate}
\item 自反性
\item 对称性
\item 传递性
\end{enumerate}
\end{exercise}

\begin{proof}
\textbf{Claim} 如果\(a\equiv b\mod n\)，则\(a+c\equiv b+c\mod n\)

如果\(a\equiv b\mod n\),则\(a=k_1n+p\),\(b=k_2n+p\),\(c=k_3n+c'\),其中\(k_1,k_2,k_3\in\Z\),\(p,c'\in\N\)
且\(p,c'<n\)。若\(p+c'<n\)，则\(a+c\equiv p+c'\equiv b=c\mod n\),若\(p+c'\ge n\)，
则\(a+c\equiv p+c'-n\equiv b+c\mod n\)，因此\(a+c\equiv b+c\mod n\)

\begin{enumerate}
\item \(a-a\equiv 0\mod n\)，于是\(a\equiv a\mod n\)
\item 如果\(a\equiv b\mod n\) ,于是\(a-b\equiv 0\mod n\)，即存在\(k\in\Z\)使得\(a-b=kn\)，因此\(b-a=(-k)n\)，
即\(b-a\equiv 0\mod n\),因此\(b\equiv a\mod n\)
\item 若\(a\equiv b\mod n\),\(b\equiv c\mod n\)，则\(a-b\equiv 0\equiv c-b\mod n\)，因此\(a\equiv c\mod n\)
\end{enumerate}
\end{proof}

\begin{exercise}[1.3.3]
判断下列命题是否对所有集合\(A,B,C\)和\(D\)成立，并给出理由
\begin{enumerate}
\item \(A\times(B\cup C)=(A\times B)\cup(A\times C)\)
\item \((A\times B)\cap(C\times D)=(A\cap C)\times(B\cap D)\)
\item \((A\times B)\cup(C\times D)=(A\cup C)\times(B\cup D)\)
\end{enumerate}
\end{exercise}

\begin{proof}
\begin{enumerate}
\item 成立
\begin{align*}
(x,y)\in A\times(B\cup C)&\Leftrightarrow x\in A\wedge y\in B\cup C\\
&\Leftrightarrow x\in A\wedge(y\in B\vee y\in C)\\
&\Leftrightarrow(x\in A\wedge y\in B)\vee(x\in A\wedge y\in C)\\
&\Leftrightarrow(x,y)\in A\times B\vee(x,y)\in A\times C\\
&\Leftrightarrow(x,y)\in(A\times B)\cup(A\times C)
\end{align*}
\item 成立
\begin{align*}
(x,y)\in(A\times B)\cap(C\times D)&\Leftrightarrow (x,y)\in A\times B\wedge (x,y)\in C\times D\\
&\Leftrightarrow(x\in A\wedge y\in B)\wedge(x\in C\wedge y\in D)\\
&\Leftrightarrow(x\in A\wedge x\in C)\wedge(y\in B\wedge y\in D)\\
&\Leftrightarrow(x\in A\cap C)\wedge(y\in B\cap D)\\
&\Leftrightarrow(x,y)\in (A\cap C)\times (B\cap D)
\end{align*}
\item 不成立，对于\(a\in A,d\in D\),\((a,d)\notin(A\times B)\cup(C\times D)\)但是\((a,d)\in(A\cup C)\times(B\cup D)\)
\end{enumerate}
\end{proof}

\begin{exercise}
证明：如果\(X\subset Y\)，那么\(X\cap Y=X\)
\end{exercise}

\begin{proof}
对于任意\(x\in X\cap Y\), 则\(x\in X\)且\(x\in Y\)，因此\(x\in X\)，于是\(X\cap Y\subset X\)

对于任意\(x\in X\),因为\(X\subset Y\)，于是\(x\in Y\)，因此\(x\in X\cap Y\)，于是\(X\subset X\cap Y\)

所以\(X\cap Y=X\)
\end{proof}

\begin{exercise}
举例：\(R\)是对称的也是反对称的
\end{exercise}

\begin{proof}
如果\(R\)是对称的也是反对称的，考虑论域\(U\)与任意元素\(a,b\),则\(aRb\Rightarrow bRa\Rightarrow a=b\).

因此给定论域\(\N\)，\(R=\{(n,n):n\in\N\}\)是对称的且是反对称的
\end{proof}

\begin{exercise}
验证：自然数集\(\N\)上的整除关系是偏序。整数集\(\Z\)上的整除关系呢？
\end{exercise}

\begin{proof}
对于\(a,b\in\N\)，令\(aRb\)当且仅当\(a\mid b\).

对于任意\(a,b,c\in\N\)
\begin{itemize}
\item \(a\mid a\)，因此\(R\)是自反的
\item 若\(a\mid b\)且\(b\mid a\)，那么\(a=b\),因此\(R\)是反对称的
\item 若\(a\mid b\)且\(b\mid c\)，那么\(a\mid c\),因此\(R\)是传递的
\end{itemize}


因此\(R\)是\(\N\)上的偏序

\(\Z\)上的整除关系不是反对称的，考虑\(-2\mid 2\)与\(2\mid -2\)
\end{proof}

\begin{exercise}
考虑\(\calf=\{X_i\mid i\in\N\}\)，对\(i\in\N\)，定义\(Y_i=\bigcap_{j\le i}X_j\)，证明：\(\bigcap\calf=\bigcap_{i\in\N}Y_i\)
\end{exercise}

\begin{proof}
对于任意\(x\in\bigcap\calf\)，对于任意\(i\in\N\),\(x\in X_i\)，于是对于任意\(i\in\N\),\(x\in Y_i\),因此\(x\in\bigcap_{i\in\N}Y_i\)，
因此\(\bigcap\calf\subset\bigcap_{i\in\N}Y_i\)

对于任意\(x\in\bigcap_{i\in\N}Y_i\)，对于任意\(i\in\N\),\(x\in Y_i\)，即\(x\in\bigcap_{j\le i}X_j\)，于是\(x\in X_i\)。因
此\(x\in\bigcap\calf\),\(\bigcap_{i\in\N}\subset\bigcap\calf\)

所以\(\bigcap\calf=\bigcap_{i\in\N}Y_i\)
\end{proof}
\end{document}
